export const agencyData = [
  {
    "value": "510000",
    "label": "四川省市场监督管理局",
    "children": [
      {
        "value": "510100",
        "label": "成都市市场监督管理局",
        "children": [
          {
            "value": "510104",
            "label": "成都市锦江区市场监督管理局"
          },
          {
            "value": "510105",
            "label": "成都市青羊区市场监督管理局"
          },
          {
            "value": "510106",
            "label": "成都市金牛区市场监督管理局"
          },
          {
            "value": "510107",
            "label": "成都市武侯区市场监督管理局"
          },
          {
            "value": "510108",
            "label": "成都市成华区市场监督管理局"
          },
          {
            "value": "510112",
            "label": "成都市龙泉驿区市场监督管理局"
          },
          {
            "value": "510113",
            "label": "成都市青白江区市场监督管理局"
          },
          {
            "value": "510114",
            "label": "成都市新都区市场监督管理局"
          },
          {
            "value": "510115",
            "label": "成都市温江区市场监督管理局"
          },
          {
            "value": "510116",
            "label": "成都市双流区市场监督管理局"
          },
          {
            "value": "510117",
            "label": "成都市郫都区市场监督管理局"
          },
          {
            "value": "510118",
            "label": "成都市新津区市场监督管理局"
          },
          {
            "value": "510121",
            "label": "成都市金堂县市场监督管理局"
          },
          {
            "value": "510129",
            "label": "成都市大邑县市场监督管理局"
          },
          {
            "value": "510131",
            "label": "成都市蒲江县市场监督管理局"
          },
          {
            "value": "510181",
            "label": "成都市都江堰市市场监督管理局"
          },
          {
            "value": "510182",
            "label": "成都市彭州市市场监督管理局"
          },
          {
            "value": "510183",
            "label": "成都市邛崃市市场监督管理局"
          },
          {
            "value": "510184",
            "label": "成都市崇州市市场监督管理局"
          },
          {
            "value": "510185",
            "label": "成都市简阳市市场监督管理局"
          },
          {
            "value": "510171",
            "label": "四川天府新区市场监督管理局"
          },
          {
            "value": "510172",
            "label": "成都高新技术产业开发区市场监督管理局"
          }
        ]
      },
      {
        "value": "510300",
        "label": "自贡市市场监督管理局",
        "children": [
          {
            "value": "510302",
            "label": "自贡市自流井区市场监督管理局"
          },
          {
            "value": "510303",
            "label": "自贡市贡井区市场监督管理局"
          },
          {
            "value": "510304",
            "label": "自贡市大安区市场监督管理局"
          },
          {
            "value": "510311",
            "label": "自贡市沿滩区市场监督管理局"
          },
          {
            "value": "510321",
            "label": "自贡市荣县市场监督管理局"
          },
          {
            "value": "510322",
            "label": "自贡市富顺县市场监督管理局"
          }
        ]
      },
      {
        "value": "510400",
        "label": "攀枝花市市场监督管理局",
        "children": [
          {
            "value": "510402",
            "label": "攀枝花市东区市场监督管理局"
          },
          {
            "value": "510403",
            "label": "攀枝花市西区市场监督管理局"
          },
          {
            "value": "510411",
            "label": "攀枝花市仁和区市场监督管理局"
          },
          {
            "value": "510421",
            "label": "攀枝花市米易县市场监督管理局"
          },
          {
            "value": "510422",
            "label": "攀枝花市盐边县市场监督管理局"
          }
        ]
      },
      {
        "value": "510500",
        "label": "泸州市市场监督管理局",
        "children": [
          {
            "value": "510502",
            "label": "泸州市江阳区市场监督管理局"
          },
          {
            "value": "510503",
            "label": "泸州市纳溪区市场监督管理局"
          },
          {
            "value": "510504",
            "label": "泸州市龙马潭区市场监督管理局"
          },
          {
            "value": "510521",
            "label": "泸州市泸县市场监督管理局"
          },
          {
            "value": "510522",
            "label": "泸州市合江县市场监督管理局"
          },
          {
            "value": "510524",
            "label": "泸州市叙永县市场监督管理局"
          },
          {
            "value": "510525",
            "label": "泸州市古蔺县市场监督管理局"
          }
        ]
      },
      {
        "value": "510600",
        "label": "德阳市市场监督管理局",
        "children": [
          {
            "value": "510603",
            "label": "德阳市旌阳区市场监督管理局"
          },
          {
            "value": "510604",
            "label": "德阳市罗江区市场监督管理局"
          },
          {
            "value": "510623",
            "label": "德阳市中江县市场监督管理局"
          },
          {
            "value": "510681",
            "label": "德阳市广汉市市场监督管理局"
          },
          {
            "value": "510682",
            "label": "德阳市什邡市市场监督管理局"
          },
          {
            "value": "510683",
            "label": "德阳市绵竹市市场监督管理局"
          }
        ]
      },
      {
        "value": "510700",
        "label": "绵阳市市场监督管理局",
        "children": [
          {
            "value": "510703",
            "label": "绵阳市涪城区市场监督管理局"
          },
          {
            "value": "510704",
            "label": "绵阳市游仙区市场监督管理局"
          },
          {
            "value": "510705",
            "label": "绵阳市安州区市场监督管理局"
          },
          {
            "value": "510722",
            "label": "绵阳市三台县市场监督管理局"
          },
          {
            "value": "510723",
            "label": "绵阳市盐亭县市场监督管理局"
          },
          {
            "value": "510725",
            "label": "绵阳市梓潼县市场监督管理局"
          },
          {
            "value": "510726",
            "label": "绵阳市北川羌族自治县市场监督管理局"
          },
          {
            "value": "510727",
            "label": "绵阳市平武县市场监督管理局"
          },
          {
            "value": "510781",
            "label": "绵阳市江油市市场监督管理局"
          }
        ]
      },
      {
        "value": "510800",
        "label": "广元市市场监督管理局",
        "children": [
          {
            "value": "510802",
            "label": "广元市利州区市场监督管理局"
          },
          {
            "value": "510811",
            "label": "广元市昭化区市场监督管理局"
          },
          {
            "value": "510812",
            "label": "广元市朝天区市场监督管理局"
          },
          {
            "value": "510821",
            "label": "广元市旺苍县市场监督管理局"
          },
          {
            "value": "510822",
            "label": "广元市青川县市场监督管理局"
          },
          {
            "value": "510823",
            "label": "广元市剑阁县市场监督管理局"
          },
          {
            "value": "510824",
            "label": "广元市苍溪县市场监督管理局"
          }
        ]
      },
      {
        "value": "510900",
        "label": "遂宁市市场监督管理局",
        "children": [
          {
            "value": "510903",
            "label": "遂宁市船山区市场监督管理局"
          },
          {
            "value": "510904",
            "label": "遂宁市安居区市场监督管理局"
          },
          {
            "value": "510921",
            "label": "遂宁市蓬溪县市场监督管理局"
          },
          {
            "value": "510922",
            "label": "遂宁市射洪市市场监督管理局"
          },
          {
            "value": "510923",
            "label": "遂宁市大英县市场监督管理局"
          }
        ]
      },
      {
        "value": "511000",
        "label": "内江市市场监督管理局",
        "children": [
          {
            "value": "511002",
            "label": "内江市市中区市场监督管理局"
          },
          {
            "value": "511011",
            "label": "内江市东兴区市场监督管理局"
          },
          {
            "value": "511024",
            "label": "内江市威远县市场监督管理局"
          },
          {
            "value": "511025",
            "label": "内江市资中县市场监督管理局"
          },
          {
            "value": "511083",
            "label": "内江市隆昌市市场监督管理局"
          }
        ]
      },
      {
        "value": "511100",
        "label": "乐山市市场监督管理局",
        "children": [
          {
            "value": "511102",
            "label": "乐山市市中区市场监督管理局"
          },
          {
            "value": "511111",
            "label": "乐山市沙湾区市场监督管理局"
          },
          {
            "value": "511112",
            "label": "乐山市五通桥区市场监督管理局"
          },
          {
            "value": "511113",
            "label": "乐山市金口河区市场监督管理局"
          },
          {
            "value": "511123",
            "label": "乐山市犍为县市场监督管理局"
          },
          {
            "value": "511124",
            "label": "乐山市井研县市场监督管理局"
          },
          {
            "value": "511126",
            "label": "乐山市沐川县市场监督管理局"
          },
          {
            "value": "511129",
            "label": "乐山市峨边彝族自治县市场监督管理局"
          },
          {
            "value": "511132",
            "label": "乐山市马边彝族自治县市场监督管理局"
          },
          {
            "value": "511181",
            "label": "乐山市峨眉山市市场监督管理局"
          }
        ]
      },
      {
        "value": "511300",
        "label": "南充市市场监督管理局",
        "children": [
          {
            "value": "511302",
            "label": "南充市顺庆区市场监督管理局"
          },
          {
            "value": "511303",
            "label": "南充市高坪区市场监督管理局"
          },
          {
            "value": "511304",
            "label": "南充市嘉陵区市场监督管理局"
          },
          {
            "value": "511321",
            "label": "南充市南部县市场监督管理局"
          },
          {
            "value": "511322",
            "label": "南充市营山县市场监督管理局"
          },
          {
            "value": "511323",
            "label": "南充市蓬安县市场监督管理局"
          },
          {
            "value": "511324",
            "label": "南充市仪陇县市场监督管理局"
          },
          {
            "value": "511325",
            "label": "南充市西充县市场监督管理局"
          },
          {
            "value": "511381",
            "label": "南充市阆中市市场监督管理局"
          }
        ]
      },
      {
        "value": "511400",
        "label": "眉山市市场监督管理局",
        "children": [
          {
            "value": "511402",
            "label": "眉山市东坡区市场监督管理局"
          },
          {
            "value": "511403",
            "label": "眉山市彭山区市场监督管理局"
          },
          {
            "value": "511421",
            "label": "眉山市仁寿县市场监督管理局"
          },
          {
            "value": "511423",
            "label": "眉山市洪雅县市场监督管理局"
          },
          {
            "value": "511424",
            "label": "眉山市丹棱县市场监督管理局"
          },
          {
            "value": "511425",
            "label": "眉山市青神县市场监督管理局"
          }
        ]
      },
      {
        "value": "511500",
        "label": "宜宾市市场监督管理局",
        "children": [
          {
            "value": "511502",
            "label": "宜宾市翠屏区市场监督管理局"
          },
          {
            "value": "511503",
            "label": "宜宾市南溪区市场监督管理局"
          },
          {
            "value": "511504",
            "label": "宜宾市叙州区市场监督管理局"
          },
          {
            "value": "511523",
            "label": "宜宾市江安县市场监督管理局"
          },
          {
            "value": "511524",
            "label": "宜宾市长宁县市场监督管理局"
          },
          {
            "value": "511525",
            "label": "宜宾市高县市场监督管理局"
          },
          {
            "value": "511526",
            "label": "宜宾市珙县市场监督管理局"
          },
          {
            "value": "511527",
            "label": "宜宾市筠连县市场监督管理局"
          },
          {
            "value": "511528",
            "label": "宜宾市兴文县市场监督管理局"
          },
          {
            "value": "511529",
            "label": "宜宾市屏山县市场监督管理局"
          }
        ]
      },
      {
        "value": "511600",
        "label": "广安市市场监督管理局",
        "children": [
          {
            "value": "511602",
            "label": "广安市广安区市场监督管理局"
          },
          {
            "value": "511603",
            "label": "广安市前锋区市场监督管理局"
          },
          {
            "value": "511621",
            "label": "广安市岳池县市场监督管理局"
          },
          {
            "value": "511622",
            "label": "广安市武胜县市场监督管理局"
          },
          {
            "value": "511623",
            "label": "广安市邻水县市场监督管理局"
          },
          {
            "value": "511681",
            "label": "广安市华蓥市市场监督管理局"
          }
        ]
      },
      {
        "value": "511700",
        "label": "达州市市场监督管理局",
        "children": [
          {
            "value": "511702",
            "label": "达州市通川区市场监督管理局"
          },
          {
            "value": "511703",
            "label": "达州市达川区市场监督管理局"
          },
          {
            "value": "511722",
            "label": "达州市大竹县市场监督管理局"
          },
          {
            "value": "511723",
            "label": "达州市渠县市场监督管理局"
          },
          {
            "value": "511724",
            "label": "达州市开江县市场监督管理局"
          },
          {
            "value": "511725",
            "label": "达州市宣汉县市场监督管理局"
          },
          {
            "value": "511781",
            "label": "达州市万源市市场监督管理局"
          }
        ]
      },
      {
        "value": "511800",
        "label": "雅安市市场监督管理局",
        "children": [
          {
            "value": "511802",
            "label": "雅安市雨城区市场监督管理局"
          },
          {
            "value": "511803",
            "label": "雅安市名山区市场监督管理局"
          },
          {
            "value": "511822",
            "label": "雅安市荥经县市场监督管理局"
          },
          {
            "value": "511823",
            "label": "雅安市汉源县市场监督管理局"
          },
          {
            "value": "511824",
            "label": "雅安市石棉县市场监督管理局"
          },
          {
            "value": "511825",
            "label": "雅安市天全县市场监督管理局"
          },
          {
            "value": "511826",
            "label": "雅安市芦山县市场监督管理局"
          },
          {
            "value": "511827",
            "label": "雅安市宝兴县市场监督管理局"
          }
        ]
      },
      {
        "value": "511900",
        "label": "巴中市市场监督管理局",
        "children": [
          {
            "value": "511902",
            "label": "巴中市巴州区市场监督管理局"
          },
          {
            "value": "511903",
            "label": "巴中市恩阳区市场监督管理局"
          },
          {
            "value": "511921",
            "label": "巴中市通江县市场监督管理局"
          },
          {
            "value": "511922",
            "label": "巴中市南江县市场监督管理局"
          },
          {
            "value": "511923",
            "label": "巴中市平昌县市场监督管理局"
          }
        ]
      },
      {
        "value": "512000",
        "label": "资阳市市场监督管理局",
        "children": [
          {
            "value": "512002",
            "label": "资阳市雁江区市场监督管理局"
          },
          {
            "value": "512021",
            "label": "资阳市安岳县市场监督管理局"
          },
          {
            "value": "512022",
            "label": "资阳市乐至县市场监督管理局"
          }
        ]
      },
      {
        "value": "513200",
        "label": "阿坝藏族羌族自治州市场监督管理局",
        "children": [
          {
            "value": "513221",
            "label": "马尔康市市场监督管理局"
          },
          {
            "value": "513222",
            "label": "汶川县市场监督管理局"
          },
          {
            "value": "513223",
            "label": "理县市场监督管理局"
          },
          {
            "value": "513224",
            "label": "茂县市场监督管理局"
          },
          {
            "value": "513225",
            "label": "松潘县市场监督管理局"
          },
          {
            "value": "513226",
            "label": "九寨沟县市场监督管理局"
          },
          {
            "value": "513227",
            "label": "金川县市场监督管理局"
          },
          {
            "value": "513228",
            "label": "小金县市场监督管理局"
          },
          {
            "value": "513229",
            "label": "黑水县市场监督管理局"
          },
          {
            "value": "513230",
            "label": "壤塘县市场监督管理局"
          },
          {
            "value": "513231",
            "label": "阿坝县市场监督管理局"
          },
          {
            "value": "513232",
            "label": "若尔盖县市场监督管理局"
          },
          {
            "value": "513233",
            "label": "红原县市场监督管理局"
          }
        ]
      },
      {
        "value": "513300",
        "label": "甘孜藏族自治州市场监督管理局",
        "children": [
          {
            "value": "513321",
            "label": "康定市市场监督管理局"
          },
          {
            "value": "513322",
            "label": "泸定县市场监督管理局"
          },
          {
            "value": "513323",
            "label": "丹巴县市场监督管理局"
          },
          {
            "value": "513324",
            "label": "九龙县市场监督管理局"
          },
          {
            "value": "513325",
            "label": "雅江县市场监督管理局"
          },
          {
            "value": "513326",
            "label": "道孚县市场监督管理局"
          },
          {
            "value": "513327",
            "label": "炉霍县市场监督管理局"
          },
          {
            "value": "513328",
            "label": "甘孜县市场监督管理局"
          },
          {
            "value": "513329",
            "label": "新龙县市场监督管理局"
          },
          {
            "value": "513330",
            "label": "德格县市场监督管理局"
          },
          {
            "value": "513331",
            "label": "白玉县市场监督管理局"
          },
          {
            "value": "513332",
            "label": "石渠县市场监督管理局"
          },
          {
            "value": "513333",
            "label": "色达县市场监督管理局"
          },
          {
            "value": "513334",
            "label": "理塘县市场监督管理局"
          },
          {
            "value": "513335",
            "label": "巴塘县市场监督管理局"
          },
          {
            "value": "513336",
            "label": "乡城县市场监督管理局"
          },
          {
            "value": "513337",
            "label": "稻城县市场监督管理局"
          },
          {
            "value": "513338",
            "label": "得荣县市场监督管理局"
          }
        ]
      },
      {
        "value": "513400",
        "label": "凉山彝族自治州市场监督管理局",
        "children": [
          {
            "value": "513401",
            "label": "西昌市市场监督管理局"
          },
          {
            "value": "513422",
            "label": "木里藏族自治县市场监督管理局"
          },
          {
            "value": "513423",
            "label": "盐源县市场监督管理局"
          },
          {
            "value": "513424",
            "label": "德昌县市场监督管理局"
          },
          {
            "value": "513425",
            "label": "会理市市场监督管理局"
          },
          {
            "value": "513426",
            "label": "会东县市场监督管理局"
          },
          {
            "value": "513427",
            "label": "宁南县市场监督管理局"
          },
          {
            "value": "513428",
            "label": "普格县市场监督管理局"
          },
          {
            "value": "513429",
            "label": "布拖县市场监督管理局"
          },
          {
            "value": "513430",
            "label": "金阳县市场监督管理局"
          },
          {
            "value": "513431",
            "label": "昭觉县市场监督管理局"
          },
          {
            "value": "513432",
            "label": "喜德县市场监督管理局"
          },
          {
            "value": "513433",
            "label": "冕宁县市场监督管理局"
          },
          {
            "value": "513434",
            "label": "越西县市场监督管理局"
          },
          {
            "value": "513435",
            "label": "甘洛县市场监督管理局"
          },
          {
            "value": "513436",
            "label": "美姑县市场监督管理局"
          },
          {
            "value": "513437",
            "label": "雷波县市场监督管理局"
          }
        ]
      }
    ]
  }
];
